MetalheadKen/C-Programming-Language/STM32F4_Project/STM32_USART/Utilities/STM32_EVAL/STM32F4_EVB/stm32f4_evb_audio_codec.c
    return 0;
}

/**
  * @brief  This function Pauses or Resumes the audio file stream. In case
  *         of using DMA, the DMA Pause feature is used. In all cases the I2S
  *         peripheral is disabled.
  *
  * @WARNING When calling EVAL_AUDIO_PauseResume() function for pause, only
  *          this function should be called for resume (use of EVAL_AUDIO_Play()
  *          function for resume could lead to unexpected behavior).
  *
  * @param  Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *         from 0) to resume.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_PauseResume(uint32_t Cmd)
{
    /* Call the Audio Codec Pause/Resume function */
    if (Codec_PauseResume(Cmd) != 0) {
        return 1;
    } else {
        /* Call the Media layer pause/resume function */
        Audio_MAL_PauseResume(Cmd, 0);

        /* Return 0 if all operations are OK */
        return 0;
    }
}

/**
  * @brief  Stops audio playing and Power down the Audio Codec.
  * @param  Option: could be one of the following parameters
  *           - CODEC_PDWN_SW: for software power off (by writing registers).
  *                            Then no need to reconfigure the Codec after power on.
  *           - CODEC_PDWN_HW: completely shut down the codec (physically).
  *                            Then need to reconfigure the Codec after power on.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Stop(uint32_t Option)
{
    /* Call Audio Codec Stop function */
    if (Codec_Stop(Option) != 0) {
        return 1;
    } else {
        /* Call Media layer Stop function */
        Audio_MAL_Stop();

        /* Update the remaining data number */
        AudioRemSize = AudioTotalSize;

        /* Return 0 when all operations are correctly done */
        return 0;
    }
}

/**
  * @brief  Controls the current audio volume level.
  * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for
  *         Mute and 100 for Max volume level).
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_VolumeCtl(uint8_t Volume)
{
    /* Call the codec volume control function with converted volume value */
    return (Codec_VolumeCtrl(VOLUME_CONVERT(Volume)));
}

/**
  * @brief  Enables or disables the MUTE mode by software
  * @param  Command: could be AUDIO_MUTE_ON to mute sound or AUDIO_MUTE_OFF to
  *         unmute the codec and restore previous volume level.
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t EVAL_AUDIO_Mute(uint32_t Cmd)
{
    /* Call the Codec Mute function */
    return (Codec_Mute(Cmd));
}

/**
  * @brief  This function handles main Media layer interrupt.
  * @param  None
  * @retval 0 if correct communication, else wrong communication
  */
void Audio_MAL_IRQHandler(void)
{
#ifndef AUDIO_MAL_MODE_NORMAL
    uint16_t *pAddr = (uint16_t *)CurrentPos;
    uint32_t Size = AudioRemSize;
#endif /* AUDIO_MAL_MODE_NORMAL */

#ifdef AUDIO_MAL_DMA_IT_TC_EN
    /* Transfer complete interrupt */
    if (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC) != RESET) {
#ifdef AUDIO_MAL_MODE_NORMAL
        /* Check if the end of file has been reached */
        if (AudioRemSize > 0) {
            /* Wait the DMA Stream to be effectively disabled */
            while (DMA_GetCmdStatus(AUDIO_MAL_DMA_STREAM) != DISABLE)
            {}

            /* Clear the Interrupt flag */
            DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);

            /* Re-Configure the buffer address and size */
            DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) CurrentPos;
            DMA_InitStructure.DMA_BufferSize = (uint32_t) (DMA_MAX(AudioRemSize));

            /* Configure the DMA Stream with the new parameters */
            DMA_Init(AUDIO_MAL_DMA_STREAM, &DMA_InitStructure);

            /* Enable the I2S DMA Stream*/
            DMA_Cmd(AUDIO_MAL_DMA_STREAM, ENABLE);

            /* Update the current pointer position */
            CurrentPos += DMA_MAX(AudioRemSize);

            /* Update the remaining number of data to be played */
            AudioRemSize -= DMA_MAX(AudioRemSize);
        } else {
            /* Disable the I2S DMA Stream*/
            DMA_Cmd(AUDIO_MAL_DMA_STREAM, DISABLE);

            /* Clear the Interrupt flag */
            DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);

            /* Manage the remaining file size and new address offset: This function
            should be coded by user (its prototype is already declared in stm32_eval_audio_codec.h) */
            EVAL_AUDIO_TransferComplete_CallBack((uint32_t)CurrentPos, 0);
        }

#elif defined(AUDIO_MAL_MODE_CIRCULAR)
        /* Manage the remaining file size and new address offset: This function
           should be coded by user (its prototype is already declared in stm32_eval_audio_codec.h) */
        EVAL_AUDIO_TransferComplete_CallBack(pAddr, Size);

        /* Clear the Interrupt flag */
        DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC);
#endif /* AUDIO_MAL_MODE_NORMAL */
    }
#endif /* AUDIO_MAL_DMA_IT_TC_EN */

#ifdef AUDIO_MAL_DMA_IT_HT_EN
    /* Half Transfer complete interrupt */
    if (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_HT) != RESET) {
        /* Manage the remaining file size and new address offset: This function
           should be coded by user (its prototype is already declared in stm32_eval_audio_codec.h) */
        EVAL_AUDIO_HalfTransfer_CallBack((uint32_t)pAddr, Size);

        /* Clear the Interrupt flag */
        DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_HT);
    }
#endif /* AUDIO_MAL_DMA_IT_HT_EN */

#ifdef AUDIO_MAL_DMA_IT_TE_EN
    /* FIFO Error interrupt */
    if ((DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TE) != RESET) || \
            (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_FE) != RESET) || \
            (DMA_GetFlagStatus(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_DME) != RESET))

    {
        /* Manage the error generated on DMA FIFO: This function
           should be coded by user (its prototype is already declared in stm32_eval_audio_codec.h) */
        EVAL_AUDIO_Error_CallBack((uint32_t*)&pAddr);

        /* Clear the Interrupt flag */
        DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TE | AUDIO_MAL_DMA_FLAG_FE | \
                      AUDIO_MAL_DMA_FLAG_DME);
    }
#endif /* AUDIO_MAL_DMA_IT_TE_EN */
}

/*========================

                CS43L22 Audio Codec Control Functions
                                                ==============================*/
/**
  * @brief  Initializes the audio codec and all related interfaces (control
  *         interface: I2C and audio interface: I2S)
  * @param  OutputDevice: can be OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
  *                       OUTPUT_DEVICE_BOTH or OUTPUT_DEVICE_AUTO .
  * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
  * @param  AudioFreq: Audio frequency used to play the audio stream.
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_Init(uint16_t OutputDevice, uint8_t Volume, uint32_t AudioFreq)
{
    uint32_t counter = 0, ret;

    /* Configure the Codec related IOs */
    Codec_GPIO_Init();

    /* Reset the Codec Registers */
    Codec_Reset();

    /* Initialize the Control interface of the Audio Codec */
    Codec_CtrlInterface_Init();

    ret = Codec_ReadRegister(0x01);
    cid = ret >> 3;
    revid = ret & 0x07;

