MetalheadKen/C-Programming-Language/STM32F4_Project/STM32_USART/Utilities/STM32_EVAL/STM32F4_EVB/stm32f4_evb_audio_codec.c
    return counter;
}

/**
  * @brief  Sets higher or lower the codec volume level.
  * @param  Volume: a byte value from 0 to 255 (refer to codec registers
  *         description for more details).
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_VolumeCtrl(uint8_t Volume)
{
    uint32_t counter = 0;

    if (Volume > 0xE6) {
        /* Set the Master volume */
        counter += Codec_WriteRegister(0x20, Volume - 0xE7);
        counter += Codec_WriteRegister(0x21, Volume - 0xE7);
    } else {
        /* Set the Master volume */
        counter += Codec_WriteRegister(0x20, Volume + 0x19);
        counter += Codec_WriteRegister(0x21, Volume + 0x19);
    }

    return counter;
}

/**
  * @brief  Enables or disables the mute feature on the audio codec.
  * @param  Cmd: AUDIO_MUTE_ON to enable the mute or AUDIO_MUTE_OFF to disable the
  *             mute mode.
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_Mute(uint32_t Cmd)
{
    uint32_t counter = 0;

    /* Set the Mute mode */
    if (Cmd == AUDIO_MUTE_ON) {
        counter += Codec_WriteRegister(0x04, 0xFF);
    } else { /* AUDIO_MUTE_OFF Disable the Mute */
        counter += Codec_WriteRegister(0x04, OutputDev);
    }

    return counter;
}

/**
  * @brief  Resets the audio codec. It restores the default configuration of the
  *         codec (this function shall be called before initializing the codec).
  * @note   This function calls an external driver function: The IO Expander driver.
  * @param  None
  * @retval None
  */
static void Codec_Reset(void)
{
    /* Configure the IO Expander (to use the Codec Reset pin mapped on the IOExpander) */
//	IOE_Config();

    /* Power Down the codec */
//	IOE_WriteIOPin(AUDIO_RESET_PIN, BitReset);

    /* wait for a delay to insure registers erasing */
//	Delay(CODEC_RESET_DELAY);

    /* Power on the codec */
//	IOE_WriteIOPin(AUDIO_RESET_PIN, BitSet);
}

/**
  * @brief  Switch dynamically (while audio file is played) the output target
  *         (speaker or headphone).
  * @note   This function modifies a global variable of the audio codec driver: OutputDev.
  * @param  Output: specifies the audio output target: OUTPUT_DEVICE_SPEAKER,
  *         OUTPUT_DEVICE_HEADPHONE, OUTPUT_DEVICE_BOTH or OUTPUT_DEVICE_AUTO
  * @retval 0 if correct communication, else wrong communication
  */
uint32_t Codec_SwitchOutput(uint8_t Output)
{
    uint8_t counter = 0;

    switch (Output) {
        case OUTPUT_DEVICE_SPEAKER:
            counter += Codec_WriteRegister(0x04, 0xFA); /* SPK always ON & HP always OFF */
            OutputDev = 0xFA;
            break;

        case OUTPUT_DEVICE_HEADPHONE:
            counter += Codec_WriteRegister(0x04, 0xAF); /* SPK always OFF & HP always ON */
            OutputDev = 0xAF;
            break;

        case OUTPUT_DEVICE_BOTH:
            counter += Codec_WriteRegister(0x04, 0xAA); /* SPK always ON & HP always ON */
            OutputDev = 0xAA;
            break;

        case OUTPUT_DEVICE_AUTO:
            counter += Codec_WriteRegister(0x04, 0x05); /* Detect the HP or the SPK automatically */
            OutputDev = 0x05;
            break;

        default:
            counter += Codec_WriteRegister(0x04, 0x05); /* Detect the HP or the SPK automatically */
            OutputDev = 0x05;
            break;
    }

    return counter;
}

/**
  * @brief  Writes a Byte to a given register into the audio codec through the
            control interface (I2C)
  * @param  RegisterAddr: The address (location) of the register to be written.
  * @param  RegisterValue: the Byte value to be written into destination register.
  * @retval 0 if correct communication, else wrong communication
  */
static uint32_t Codec_WriteRegister(uint8_t RegisterAddr, uint8_t RegisterValue)
{
    uint32_t result = 0;

    /*!< While the bus is busy */
    CODECTimeout = CODEC_LONG_TIMEOUT;
    while(I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BUSY)) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /* Start the config sequence */
    I2C_GenerateSTART(CODEC_I2C, ENABLE);

    /* Test on EV5 and clear it */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_MODE_SELECT)) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /* Transmit the slave address and enable writing operation */
    I2C_Send7bitAddress(CODEC_I2C, CODEC_ADDRESS, I2C_Direction_Transmitter);

    /* Test on EV6 and clear it */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /* Transmit the first address for write operation */
    I2C_SendData(CODEC_I2C, RegisterAddr);

    /* Test on EV8 and clear it */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_BYTE_TRANSMITTING)) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /* Prepare the register value to be sent */
    I2C_SendData(CODEC_I2C, RegisterValue);

    /*!< Wait till all data have been physically transferred on the bus */
    CODECTimeout = CODEC_LONG_TIMEOUT;
    while(!I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BTF)) {
        if ((CODECTimeout--) == 0) Codec_TIMEOUT_UserCallback();
    }

    /* End the configuration sequence */
    I2C_GenerateSTOP(CODEC_I2C, ENABLE);

#ifdef VERIFY_WRITTENDATA
    /* Verify that the data has been correctly written */
    result = (Codec_ReadRegister(RegisterAddr) == RegisterValue)? 0:1;
#endif /* VERIFY_WRITTENDATA */

    /* Return the verifying value: 0 (Passed) or 1 (Failed) */
    return result;
}

/**
  * @brief  Reads and returns the value of an audio codec register through the
  *         control interface (I2C).
  * @param  RegisterAddr: Address of the register to be read.
  * @retval Value of the register to be read or dummy value if the communication
  *         fails.
  */
static uint32_t Codec_ReadRegister(uint8_t RegisterAddr)
{
    uint32_t result = 0;

