MetalheadKen/C-Programming-Language/STM32F4_Project/STM32_USART/Utilities/STM32_EVAL/STM32F4_EVB/stm32f4_evb_audio_codec.c
    /*!< While the bus is busy */
    CODECTimeout = CODEC_LONG_TIMEOUT;
    while(I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BUSY)) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /* Start the config sequence */
    I2C_GenerateSTART(CODEC_I2C, ENABLE);

    /* Test on EV5 and clear it */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_MODE_SELECT)) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /* Transmit the slave address and enable writing operation */
    I2C_Send7bitAddress(CODEC_I2C, CODEC_ADDRESS, I2C_Direction_Transmitter);

    /* Test on EV6 and clear it */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while (!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED)) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /* Transmit the register address to be read */
    I2C_SendData(CODEC_I2C, RegisterAddr);

    /* Test on EV8 and clear it */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while (I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_BTF) == RESET) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /*!< Send STRAT condition a second time */
    I2C_GenerateSTART(CODEC_I2C, ENABLE);

    /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while(!I2C_CheckEvent(CODEC_I2C, I2C_EVENT_MASTER_MODE_SELECT)) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /*!< Send Codec address for read */
    I2C_Send7bitAddress(CODEC_I2C, CODEC_ADDRESS, I2C_Direction_Receiver);

    /* Wait on ADDR flag to be set (ADDR is still not cleared at this level */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while(I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_ADDR) == RESET) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /*!< Disable Acknowledgment */
    I2C_AcknowledgeConfig(CODEC_I2C, DISABLE);

    /* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
    (void)CODEC_I2C->SR2;

    /*!< Send STOP Condition */
    I2C_GenerateSTOP(CODEC_I2C, ENABLE);

    /* Wait for the byte to be received */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while(I2C_GetFlagStatus(CODEC_I2C, I2C_FLAG_RXNE) == RESET) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /*!< Read the byte received from the Codec */
    result = I2C_ReceiveData(CODEC_I2C);

    /* Wait to make sure that STOP flag has been cleared */
    CODECTimeout = CODEC_FLAG_TIMEOUT;
    while(CODEC_I2C->CR1 & I2C_CR1_STOP) {
        if((CODECTimeout--) == 0) return Codec_TIMEOUT_UserCallback();
    }

    /*!< Re-Enable Acknowledgment to be ready for another reception */
    I2C_AcknowledgeConfig(CODEC_I2C, ENABLE);

    /* Clear AF flag for next communication */
    I2C_ClearFlag(CODEC_I2C, I2C_FLAG_AF);

    /* Return the byte read from Codec */
    return result;
}

/**
  * @brief  Initializes the Audio Codec control interface (I2C).
  * @param  None
  * @retval None
  */
static void Codec_CtrlInterface_Init(void)
{
    I2C_InitTypeDef I2C_InitStructure;

    /* Enable the CODEC_I2C peripheral clock */
    RCC_APB1PeriphClockCmd(CODEC_I2C_CLK, ENABLE);

    /* If the I2C peripheral is already enabled, don't reconfigure it */
    if ((CODEC_I2C->CR1 & I2C_CR1_PE) != 0) {
        /* CODEC_I2C peripheral configuration */
        I2C_DeInit(CODEC_I2C);
        I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
        I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
        I2C_InitStructure.I2C_OwnAddress1 = 0x33;
        I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
        I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
        I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;

        /* Enable the I2C peripheral */
        I2C_Cmd(CODEC_I2C, ENABLE);

        /* Initialize the I2C peripheral */
        I2C_Init(CODEC_I2C, &I2C_InitStructure);
    }
}

/**
  * @brief  Restore the Audio Codec control interface to its default state.
  *         This function doesn't de-initialize the I2C because the I2C peripheral
  *         may be used by other modules.
  * @param  None
  * @retval None
  */
static void Codec_CtrlInterface_DeInit(void)
{
    /* Disable the I2C peripheral */ /* This step is not done here because
       the I2C interface can be used by other modules */
    /* I2C_DeInit(CODEC_I2C); */
}

/**
  * @brief  Initializes the Audio Codec audio interface (I2S)
  * @note   This function assumes that the I2S input clock (through PLL_R in
  *         Devices RevA/Z and through dedicated PLLI2S_R in Devices RevB/Y)
  *         is already configured and ready to be used.
  * @param  AudioFreq: Audio frequency to be configured for the I2S peripheral.
  * @retval None
  */
static void Codec_AudioInterface_Init(uint32_t AudioFreq)
{
    I2S_InitTypeDef I2S_InitStructure;

    /* Enable the CODEC_I2S peripheral clock */
    RCC_APB1PeriphClockCmd(CODEC_I2S_CLK, ENABLE);

    /* CODEC_I2S peripheral configuration */
    SPI_I2S_DeInit(CODEC_I2S);
    I2S_InitStructure.I2S_AudioFreq = AudioFreq;
    I2S_InitStructure.I2S_Standard = I2S_STANDARD;
    I2S_InitStructure.I2S_DataFormat = I2S_DataFormat_16b;
    I2S_InitStructure.I2S_CPOL = I2S_CPOL_Low;
    I2S_InitStructure.I2S_Mode = I2S_Mode_MasterTx;
#ifdef CODEC_MCLK_ENABLED
    I2S_InitStructure.I2S_MCLKOutput = I2S_MCLKOutput_Enable;
#elif defined(CODEC_MCLK_DISABLED)
    I2S_InitStructure.I2S_MCLKOutput = I2S_MCLKOutput_Disable;
#else
#error "No selection for the MCLK output has been defined !"
#endif /* CODEC_MCLK_ENABLED */

    /* Initialize the I2S peripheral with the structure above */
    I2S_Init(CODEC_I2S, &I2S_InitStructure);

    /* The I2S peripheral will be enabled only in the EVAL_AUDIO_Play() function
         or by user functions if DMA mode not enabled */
}

/**
  * @brief  Restores the Audio Codec audio interface to its default state.
  * @param  None
  * @retval None
  */
static void Codec_AudioInterface_DeInit(void)
{
    /* Disable the CODEC_I2S peripheral (in case it hasn't already been disabled) */
    I2S_Cmd(CODEC_I2S, DISABLE);

    /* Deinitialize the CODEC_I2S peripheral */
    SPI_I2S_DeInit(CODEC_I2S);

    /* Disable the CODEC_I2S peripheral clock */
    RCC_APB1PeriphClockCmd(CODEC_I2S_CLK, DISABLE);
}

/**
  * @brief Initializes IOs used by the Audio Codec (on the control and audio
  *        interfaces).
  * @param  None
  * @retval None
  */
static void Codec_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable I2S and I2C GPIO clocks */
    RCC_AHB1PeriphClockCmd(CODEC_I2C_GPIO_CLOCK | CODEC_I2S_GPIO_CLOCK, ENABLE);

    /* CODEC_I2C SCL and SDA pins configuration -------------------------------------*/
    /* If the I2C peripheral is already enabled, don't reconfigure it */
    if ((CODEC_I2C->CR1 & I2C_CR1_PE) != I2C_CR1_PE) {
        GPIO_InitStructure.GPIO_Pin		= CODEC_I2C_SCL_PIN | CODEC_I2C_SDA_PIN;
        GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
        GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_OType	= GPIO_OType_OD;
        GPIO_InitStructure.GPIO_PuPd 	= GPIO_PuPd_NOPULL;
        GPIO_Init(CODEC_I2C_GPIO, &GPIO_InitStructure);
        /* Connect pins to Periph */
        GPIO_PinAFConfig(CODEC_I2C_GPIO, CODEC_I2S_SCL_PINSRC, CODEC_I2C_GPIO_AF);
        GPIO_PinAFConfig(CODEC_I2C_GPIO, CODEC_I2S_SDA_PINSRC, CODEC_I2C_GPIO_AF);
    }

    /* CODEC_I2S pins configuration: WS, SCK and SD pins -----------------------------*/
    GPIO_InitStructure.GPIO_Pin		= CODEC_I2S_WS_PIN | CODEC_I2S_SCK_PIN | CODEC_I2S_SD_PIN;
    GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_Speed	= GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_OType	= GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd	= GPIO_PuPd_NOPULL;
    GPIO_Init(CODEC_I2S_GPIO, &GPIO_InitStructure);
    /* Connect pins to I2S peripheral  */
    GPIO_PinAFConfig(CODEC_I2S_GPIO, CODEC_I2S_WS_PINSRC, CODEC_I2S_GPIO_AF);
    GPIO_PinAFConfig(CODEC_I2S_GPIO, CODEC_I2S_SCK_PINSRC, CODEC_I2S_GPIO_AF);
    GPIO_PinAFConfig(CODEC_I2S_GPIO, CODEC_I2S_SD_PINSRC, CODEC_I2S_GPIO_AF);

