MetalheadKen/C-Programming-Language/STM32F4_Project/STM32_USART/Utilities/STM32_EVAL/STM32F4_EVB/stm32f4_evb_audio_codec.c
    /*
       The DMA clock is not disabled, since it can be used by other streams
                                                                            */
}

/**
  * @brief  Starts playing audio stream from the audio Media.
  * @param  None
  * @retval None
  */
static void Audio_MAL_Play(uint32_t Addr, uint32_t Size)
{
    /* Configure the buffer address and size */
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)Addr;
    DMA_InitStructure.DMA_BufferSize = (uint32_t)Size;

    /* Configure the DMA Stream with the new parameters */
    DMA_Init(AUDIO_MAL_DMA_STREAM, &DMA_InitStructure);

    /* Enable the I2S DMA Stream*/
    DMA_Cmd(AUDIO_MAL_DMA_STREAM, ENABLE);

    /* If the I2S peripheral is still not enabled, enable it */
    if ((CODEC_I2S->I2SCFGR & I2S_ENABLE_MASK) == 0) {
        I2S_Cmd(CODEC_I2S, ENABLE);
    }
}

/**
  * @brief  Pauses or Resumes the audio stream playing from the Media.
  * @param  Cmd: AUDIO_PAUSE (or 0) to pause, AUDIO_RESUME (or any value different
  *              from 0) to resume.
  * @param  Addr: Address from/at which the audio stream should resume/pause.
  * @retval None
  */
static void Audio_MAL_PauseResume(uint32_t Cmd, uint32_t Addr)
{
    /* Pause the audio file playing */
    if (Cmd == AUDIO_PAUSE) {
        /* Disable the I2S DMA request */
        SPI_I2S_DMACmd(CODEC_I2S, SPI_I2S_DMAReq_Tx, DISABLE);

        /* Pause the I2S DMA Stream
            Note. For the STM32F4xx devices, the DMA implements a pause feature,
                  by disabling the stream, all configuration is preserved and data
                  transfer is paused till the next enable of the stream.*/
        DMA_Cmd(AUDIO_MAL_DMA_STREAM, DISABLE);
    } else { /* AUDIO_RESUME */
        /* Enable the I2S DMA request */
        SPI_I2S_DMACmd(CODEC_I2S, SPI_I2S_DMAReq_Tx, ENABLE);

        /* Resume the I2S DMA Stream
            Note. For the STM32F4xx devices, the DMA implements a pause feature,
                  by disabling the stream, all configuration is preserved and data
                  transfer is paused till the next enable of the stream.*/
        DMA_Cmd(AUDIO_MAL_DMA_STREAM, ENABLE);

        /* If the I2S peripheral is still not enabled, enable it */
        if ((CODEC_I2S->I2SCFGR & I2S_ENABLE_MASK) == 0) {
            I2S_Cmd(CODEC_I2S, ENABLE);
        }
    }
}

/**
  * @brief  Stops audio stream playing on the used Media.
  * @param  None
  * @retval None
  */
static void Audio_MAL_Stop(void)
{
    /* Stop the Transfer on the I2S side: Stop and disable the DMA stream */
    DMA_Cmd(AUDIO_MAL_DMA_STREAM, DISABLE);

    /* Clear all the DMA flags for the next transfer */
    DMA_ClearFlag(AUDIO_MAL_DMA_STREAM, AUDIO_MAL_DMA_FLAG_TC |AUDIO_MAL_DMA_FLAG_HT | \
                  AUDIO_MAL_DMA_FLAG_FE | AUDIO_MAL_DMA_FLAG_TE);

    /*
             The I2S DMA requests are not disabled here.
                                                              */

    /* In all modes, disable the I2S peripheral */
    I2S_Cmd(CODEC_I2S, DISABLE);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
